---
title: MEPCalculationServerInfo
classe: Autodesk.Revit.DB.MEPCalculationServerInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MEPCalculationServerInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Description { get; set; }` | `mEPCalculationServerInfo.Description` | String |
| `Boolean IsValidObject { get; }` | `mEPCalculationServerInfo.IsValidObject` | Boolean |
| `Guid PipeUseDefinitionOnTypeGUID { get; }` | `MEPCalculationServerInfo.PipeUseDefinitionOnTypeGUID` | Guid |
| `Guid ServerId { get; set; }` | `mEPCalculationServerInfo.ServerId` | Guid |
| `String ServerName { get; set; }` | `mEPCalculationServerInfo.ServerName` | String |
| `Void Dispose()` | `mEPCalculationServerInfo.Dispose()` | Void |
| `MEPCalculationServerInfo GetMEPCalculationServerInfo(FamilyInstance)` | `MEPCalculationServerInfo.GetMEPCalculationServerInfo(famInst)` | MEPCalculationServerInfo |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```